lkolbly/cmsis-svd/data/TexasInstruments/LM3S5P36.svd
        <register>
          <name>DCCTL0</name>
          <description>ADC Digital Comparator Control 0</description>
          <addressOffset>0x00000E00</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL0_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL0_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL1</name>
          <description>ADC Digital Comparator Control 1</description>
          <addressOffset>0x00000E04</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL1_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL1_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL2</name>
          <description>ADC Digital Comparator Control 2</description>
          <addressOffset>0x00000E08</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL2_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL2_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL3</name>
          <description>ADC Digital Comparator Control 3</description>
          <addressOffset>0x00000E0C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL3_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL3_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL4</name>
          <description>ADC Digital Comparator Control 4</description>
          <addressOffset>0x00000E10</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL4_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL4_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
